---
kind: other
id: Methods.T:Autodesk.Revit.DB.Phase
source: html/79a26775-8db0-6657-66b7-5f7b0e88dc6f.htm
---
# Phase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.